setwd("/Users/yuhayung/Desktop/coding/학원/world_bank")
data <- read.csv("world_bank_Data.csv", header = T)
Metadata <- read.csv("world_bank_Metadata.csv", header = T)

install.packages('dplyr')
install.packages("stringr")
library('stringr')
library('dplyr')

# 데이터 전처리 

data_clean <- data[-c(2,4:22,24)] 
data_clean <- tbl_df(data_clean)
colnames(data_clean) <-c("국가", "스리즈명", "Y2019")
data_clean



###############################################################################################
# (1) 2019년 기준 나라별 총 인구수, 그 나라에서 가장 큰 도시에 사는 인구수, 나라별 총 인구수
# 대비 그 나라에서 가장 큰 도시에 사는 인구의 비율을 구하시오.
# (Population in largest city 항목 데이터 사용)
###############################################################################################



# 나라별 총 인구수 
나라별총인구 <- subset(data_clean, 스리즈명=="Population, total") 
나라별총인구 <- 나라별총인구[-c(2)]
나라별총인구$Y2019 <- as.numeric(나라별총인구$Y2019)
나라별총인구$Y2019 <- na.omit(나라별총인구$Y2019)
나라별총인구

# 각 나라에서 가장 큰 도시에 사는 인구수 
큰도시인구 <- subset(data_clean, 스리즈명=="Population in largest city") 
큰도시인구 <- 큰도시인구[-c(2)] 
큰도시인구$Y2019 <- as.numeric(큰도시인구$Y2019)
큰도시인구$Y2019 <- na.omit(큰도시인구$Y2019)
큰도시인구

# 데이터 병합하기 기준(나라 이름)
인구 <- merge(x= 나라별총인구, y= 큰도시인구, by= "국가", all = T)
names(인구)[2] <- c("국가별총인구")
names(인구)[3] <- c("큰도시인구") 
인구 <- tbl_df(인구)

# 가장 큰 도시에 사는 인구의 비율
인구$비율 <- 인구$국가별총인구/ 인구$큰도시인구 * 100
인구 

###############################################################################################
# (2) 총 인구수 대비 그 나라에서 가장 큰 도시에 사는 인구의 비율이 가장 높은 나라 10개국 리
# 스트를 작성하시오 (비율 항목 포함)
# (3) 총 인구수 대비 그 나라에서 가장 큰 도시에 사는 인구의 비율이 가장 낮은 나라 10개국 리
# 스트를 작성하시오. (비율 항목 포함)
###############################################################################################

top10 <- 인구 %>% arrange(desc(비율)) %>% slice(1:10)
top10list <- paste(top10$국가, top10$비율, seq = ' ')
top10

bottom10 <- 인구 %>% arrange(비율) %>% slice(1:10)
bottom10list <- paste(bottom10$국가, bottom10$비율, seq = ' ')
bottom10

###############################################################################################
# (4) 해당 항목에 데이터가 없는 나라의 리스트를 작성하시오
###############################################################################################

Na국가 <- subset(인구 %>% filter(is.na(비율)),select = c(국가))['국가']
Na국가


